{"pageProps":{"recipe":{"name":"Pasta alla Zozzona","description":"a hybrid of amatriciana and carbonara, lit. \"dirty pasta\"","ingredients":"<ul>\n<li>1 lb guanciale (or 8 oz, if using sausage)</li>\n<li>8 oz sweet italian sausage, casings removed and broken up (optional)</li>\n<li>half an onion, finely diced</li>\n<li>1 16oz can canned whole tomatoes</li>\n<li>4 large egg yolks</li>\n<li>1 cup (2oz) Pecorino Romano, grated</li>\n<li>1 lb bucatini, spaghetti, or other pasta</li>\n<li>1 tsp black pepper</li>\n<li>red pepper flakes to taste</li>\n</ul>\n","instructions":"<ol>\n<li>Slice guanciale into 1/4 inch strips lengthwise, then cut each strip crosswise into 1/4 inch strips</li>\n<li>Heat olive oil in pan and cook gunaciale for about 5-10 minutes until browned. Remove and set aside, reserving a bit of grease in a bowl, and leaving the rest in the pan.</li>\n<li>Add sausage to pan and break apart with wooden spoon, then cook for 5-10 minutes until fully cooked and lightly browned. Remove and set aside. Reserve a small amount of oil separately, and strain excess, leaving some for the next step.</li>\n<li>Add diced onion and red pepper flakes and saute until translucent, then add whole tomatoes, breaking up tomatoes with your hands. Simmer sauce for 10-15 minutes.</li>\n<li>In the meantime, boil salted water for pasta and cook according to package directions.</li>\n<li>While the pasta is cooking, whisk pecorino, yolks, pepper, and reserved grease in a bowl until combined. Slowly whisk in about a half cup of pasta water directly from the cooking pasta into the mixture to temper.</li>\n<li>As soon as pasta is al dente, drain, reserving ~1 cup of pasta water. Return immediately to pot and toss with meat, and egg and cheese mixture. Keep pasta moving to avoid allowing eggs to set. Once well-coated, toss with tomato sauce; if mixture is too thick, mix in a bit of reserved pasta water at a time. Serve immeediately.</li>\n</ol>\n","tags":"guanciale, sausage, tomato, carbonara, amatriciana, italian, roman, pasta","category":"food","notes":"","_id":"pasta-alla-zozzona"},"key":"pasta-alla-zozzona"},"__N_SSG":true}