{"pageProps":{"resume":"<h2>Education</h2>\n<h3>The College of William and Mary <em>2013 - 2017</em></h3>\n<p>Bachelor of Science, Computer Science</p>\n<h2>Professional Experience</h2>\n<h3>Def Method</h3>\n<p><em>Virtual</em> 2022 - 2023</p>\n<p>Title: Software Engineer</p>\n<p>Practiced the techniques of Test Driven Development (TDD) and pair programming extensively to ensure the delivery of quality custom software to customers.</p>\n<ul>\n<li>At Dick’s Sporting Goods\n<ul>\n<li>Worked with the loyalty team on primarily backend services involved in the business’s rewards program.</li>\n<li>Improved performance and communication between systems by building APIs between legacy systems and newer consumers, combining data sources, and transforming data as needed to provide the required data and API behavior to internal consumers.</li>\n<li>Made rewards progress more clear to users of three of the business’s major brands by working with marketing stakeholders to improve the UX of account summary page.</li>\n</ul>\n</li>\n</ul>\n<h3>Coveros</h3>\n<p><em>DC Metro Area</em> 2018 - 2022</p>\n<p>Title: Software Consultant</p>\n<p>Provided DevOps and agile development consulting to commercial and government clients of all sizes.</p>\n<ul>\n<li>At TaxAct/Blucora\n<ul>\n<li>Improved test automation practices by designing and implementing enhancements to an expansive Selenium testing framework using test driven development and pair programming to deliver and share knowledge in a brief timeframe.</li>\n</ul>\n</li>\n<li>At Fannie Mae Application Security Program\n<ul>\n<li>Built a containerized security testing pipeline to perform and scale static code analysis across Fannie Mae’s application portfolio.</li>\n<li>Moved legacy analysis tools into the cloud by building Python and Groovy scripts packaged in Docker containers.</li>\n</ul>\n</li>\n<li>At Centers for Medicare and Medicaid Services PECOS Program\n<ul>\n<li>Built a Continuous Integration/Continuous Delivery pipeline and maintained the Kubernetes infrastructure supporting a microservice-architectured application.</li>\n<li>Ensured features were tested thoroughly and deployed swiftly by working closely with developers and implementing automation in the pipeline using Groovy, Python, and Bash scripts.</li>\n</ul>\n</li>\n</ul>\n<h3>Savi</h3>\n<p><em>Alexandria, VA</em> Summer - Fall 2017</p>\n<p>Title: Data Science Intern</p>\n<p>Worked as a member of the data science team.</p>\n<ul>\n<li>Processed and generated analytics for immense sets of data using Spark SQL and SciPy (scientific Python) packages.</li>\n<li>Improved location data for thousands of seaports by applying algorithms and machine learning to GIS data sets.</li>\n<li>Coordinated with development, data science, and engineering teams in daily scrums.</li>\n</ul>\n<h3>Urgent.ly</h3>\n<p><em>Vienna, VA</em> Summer 2016</p>\n<p>Title: Development Intern</p>\n<p>Worked as a member of the development team in an agile environment.</p>\n<ul>\n<li>Constructed a visual monitoring system of critical metrics using Python and Bash scripts to collect the metrics and a web application using JavaScript and AngularJS to display them.</li>\n<li>Eliminated the need for manual monitoring of servers by building scripts to automatically notify the appropriate developers via email when a server was not functioning correctly.</li>\n</ul>\n<h3>MHelpDesk</h3>\n<p><em>Fairfax, VA</em> Summer 2015</p>\n<p>Title: Product and Development Intern</p>\n<p>Assisted Project Manager with coordination between teams.</p>\n<ul>\n<li>Categorized and analyzed change requests with Excel data and presented analysis to project management.</li>\n<li>Developed user stories to discover typical use cases and inform the design of applications.</li>\n<li>Prototyped web pages and applications using Balsamiq.</li>\n</ul>\n<h2>Skills</h2>\n<ul>\n<li>Programming Languages:\n<ul>\n<li>Python, JavaScript, TypeScript, Java,  C# (.NET), SQL, Kotlin, Groovy, C, C++</li>\n</ul>\n</li>\n<li>Technologies &#x26; Tools:\n<ul>\n<li>React, AWS, Git, Docker, Kubernetes, Jenkins, Linux, Bash, JMeter, LATEX, Gimp/Photoshop</li>\n</ul>\n</li>\n</ul>\n"},"__N_SSG":true}