{"pageProps":{"recipes":[{"name":"pasta con il pistacchio","description":"pasta with pistacchios and sausage","ingredients":"\n* 4 links sweet italian sausage\n* 2 tbsp olive oil\n* 1 glass white wine\n* 4 cloves garlic\n* crushed red pepper flakes\n* 28oz whole peeled tomatoes, chopped or crushed by hand\n* a few mint leaves\n* 1 lb casarecce pasta\n* 1 cup crushed pistacchio, divided in two","instructions":"\nUsing two pans, one to saute the sausage, another for garlic:\n1. In the first pan, saute the sausage, casings removed, in olive oil and break up. When browned, add a glass of white wine and cook off.\n1. In the other pan, saute garlic and a bit of crushed red pepper. Once aromatic, add the chopped whole tomatoes and half of the pistacchio.\n1. Once the sauce is combined, allow to simmer for about 15 minutes. While sauce is simmering, cook pasta to package instructions. \n1. When simmering is done, combine sausage with sauce and salt to taste.\n1. With the fire off, add mint leaves and the rest of the pistacchios, then toss with pasta.","tags":"sausage, pistacchio, pistachio, tomato, pasta, italian","notes":"A paella pan or wok is good for combining ingredients","_id":"pasta-con-il-pistacchio"},{"name":"pancakes","description":"basic pancakes","ingredients":"\n* 1 cup AP flour\n* 1 tsp baking powder\n* 1/8 tsp table salt (about 1/4 tsp diamond crystal kosher salt)\n* 1 tbsp sugar\n* 1 egg\n* 3/4+ cups milk\n* 1 tbsp melted butter, cooled slightly","instructions":"\n1. Heat a large skillet over medium low heat.\n1. Mix together dry ingredients in a large bowl.\n1. Separately, beat eggs into milk, then stir in butter.\n1. Lightly stir wet mixture into dry, thinning with additional milk if needed. Optionally, stir in a handful of chocolate chips, blueberries, or other additions.\n1. Cook pancakes in about a tsp of butter or oil, allowing fat to heat up before ladeling in about 1/4 cup of batter per pancake. \n1. Flip pancakes when the surface bubbles, after around 2 minutes, and cook on the other side until just browned.\n1. To keep warm, optionally store on a heatproof plate in a 200 degree oven.","tags":"pancakes, breakfast","notes":"makes about 2 servings of pancakes","_id":"basic-pancakes"},{"name":"nashville hot tofu","description":"sacrilege","ingredients":"\nhot butter\n* 8 tbsp unsalted butter\n* 2 tbsp distilled vinegar\n* 1 tbsp hot sauce\n* 1 tbsp ground cayenne\n* 1 tsp black pepper\n* 1/2 tsp garlic powder\n* 1/2 tsp onion powder\n\ntofu\n* 1 package firm tofu, drained\n* 1/4 cup whole milk\n* 1 cup AP flour\n* 2 tbsp cornstarch\n* 2 tsp baking pwder\n* kosher salt\n* heaping 1/2 cup chilled seltzer water / club soda\n* vegetable oil\n\nassembly\n* 8 slider buns or quartered buns / bread\n* lettuce, pickles\n* mayonnaise or comeback sauce","instructions":"\n1. melt butter in a small saucepan and mix in remaining hot bbutter ingredients.\n1. Divide tofu into eight pieces by cuting the tofu in half parallel to the cutting board, then  quartering each half.\n1. Pat tofu dry and set on towel or paper towel lined plate.\n1. Place milk and half of the flour in shallow bowls.\n1. Whisk half the flour, cornstarch, baking powder, and salt together in a medium bowl, then gently whisk in soda water.\n1. Heat a half inch of oil in a heavy skillet to 375 degrees.\n1. Dredge tofu in milk, then completely coat in flour. Dip in batter, drip off excess, and cook in the oil in two batches.\n1. Fry undisturbed for at least 2 minutes to allow batter to set. Turn and cook for about 3 more minutes or until golden brown on all sides, flipping more as needed.\n1. Transfer cooked tofu to a paper towel-lined surface and sprinkle with salt.\n1. Brush tofu with hot tofu and serve on buns with desired toppings.","tags":"tofu, hot, nashville, big game, hungry boys","notes":"","_id":"nashville-hot-tofu"}]},"__N_SSG":true}